MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH064/mcu.h
extern volatile __OFF103bits_t OFF103bits __asm__ ("OFF103") __attribute__((section("sfrs"), address(0xBF8106DC)));
#define OFF104 OFF104
extern volatile uint32_t   OFF104 __attribute__((section("sfrs"), address(0xBF8106E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF104bits_t;
extern volatile __OFF104bits_t OFF104bits __asm__ ("OFF104") __attribute__((section("sfrs"), address(0xBF8106E0)));
#define OFF105 OFF105
extern volatile uint32_t   OFF105 __attribute__((section("sfrs"), address(0xBF8106E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF105bits_t;
extern volatile __OFF105bits_t OFF105bits __asm__ ("OFF105") __attribute__((section("sfrs"), address(0xBF8106E4)));
#define OFF106 OFF106
extern volatile uint32_t   OFF106 __attribute__((section("sfrs"), address(0xBF8106E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF106bits_t;
extern volatile __OFF106bits_t OFF106bits __asm__ ("OFF106") __attribute__((section("sfrs"), address(0xBF8106E8)));
#define OFF109 OFF109
extern volatile uint32_t   OFF109 __attribute__((section("sfrs"), address(0xBF8106F4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF109bits_t;
extern volatile __OFF109bits_t OFF109bits __asm__ ("OFF109") __attribute__((section("sfrs"), address(0xBF8106F4)));
#define OFF110 OFF110
extern volatile uint32_t   OFF110 __attribute__((section("sfrs"), address(0xBF8106F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF110bits_t;
extern volatile __OFF110bits_t OFF110bits __asm__ ("OFF110") __attribute__((section("sfrs"), address(0xBF8106F8)));
#define OFF111 OFF111
extern volatile uint32_t   OFF111 __attribute__((section("sfrs"), address(0xBF8106FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF111bits_t;
extern volatile __OFF111bits_t OFF111bits __asm__ ("OFF111") __attribute__((section("sfrs"), address(0xBF8106FC)));
#define OFF112 OFF112
extern volatile uint32_t   OFF112 __attribute__((section("sfrs"), address(0xBF810700)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF112bits_t;
extern volatile __OFF112bits_t OFF112bits __asm__ ("OFF112") __attribute__((section("sfrs"), address(0xBF810700)));
#define OFF113 OFF113
extern volatile uint32_t   OFF113 __attribute__((section("sfrs"), address(0xBF810704)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF113bits_t;
extern volatile __OFF113bits_t OFF113bits __asm__ ("OFF113") __attribute__((section("sfrs"), address(0xBF810704)));
#define OFF114 OFF114
extern volatile uint32_t   OFF114 __attribute__((section("sfrs"), address(0xBF810708)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF114bits_t;
extern volatile __OFF114bits_t OFF114bits __asm__ ("OFF114") __attribute__((section("sfrs"), address(0xBF810708)));
#define OFF115 OFF115
extern volatile uint32_t   OFF115 __attribute__((section("sfrs"), address(0xBF81070C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF115bits_t;
extern volatile __OFF115bits_t OFF115bits __asm__ ("OFF115") __attribute__((section("sfrs"), address(0xBF81070C)));
#define OFF116 OFF116
extern volatile uint32_t   OFF116 __attribute__((section("sfrs"), address(0xBF810710)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF116bits_t;
extern volatile __OFF116bits_t OFF116bits __asm__ ("OFF116") __attribute__((section("sfrs"), address(0xBF810710)));
#define OFF117 OFF117
extern volatile uint32_t   OFF117 __attribute__((section("sfrs"), address(0xBF810714)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF117bits_t;
extern volatile __OFF117bits_t OFF117bits __asm__ ("OFF117") __attribute__((section("sfrs"), address(0xBF810714)));
#define OFF119 OFF119
extern volatile uint32_t   OFF119 __attribute__((section("sfrs"), address(0xBF81071C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF119bits_t;
extern volatile __OFF119bits_t OFF119bits __asm__ ("OFF119") __attribute__((section("sfrs"), address(0xBF81071C)));
#define OFF120 OFF120
extern volatile uint32_t   OFF120 __attribute__((section("sfrs"), address(0xBF810720)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF120bits_t;
extern volatile __OFF120bits_t OFF120bits __asm__ ("OFF120") __attribute__((section("sfrs"), address(0xBF810720)));
#define OFF121 OFF121
extern volatile uint32_t   OFF121 __attribute__((section("sfrs"), address(0xBF810724)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF121bits_t;
extern volatile __OFF121bits_t OFF121bits __asm__ ("OFF121") __attribute__((section("sfrs"), address(0xBF810724)));
#define OFF122 OFF122
extern volatile uint32_t   OFF122 __attribute__((section("sfrs"), address(0xBF810728)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF122bits_t;
extern volatile __OFF122bits_t OFF122bits __asm__ ("OFF122") __attribute__((section("sfrs"), address(0xBF810728)));
#define OFF123 OFF123
extern volatile uint32_t   OFF123 __attribute__((section("sfrs"), address(0xBF81072C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF123bits_t;
extern volatile __OFF123bits_t OFF123bits __asm__ ("OFF123") __attribute__((section("sfrs"), address(0xBF81072C)));
#define OFF124 OFF124
extern volatile uint32_t   OFF124 __attribute__((section("sfrs"), address(0xBF810730)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF124bits_t;
extern volatile __OFF124bits_t OFF124bits __asm__ ("OFF124") __attribute__((section("sfrs"), address(0xBF810730)));
#define OFF128 OFF128
extern volatile uint32_t   OFF128 __attribute__((section("sfrs"), address(0xBF810740)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF128bits_t;
extern volatile __OFF128bits_t OFF128bits __asm__ ("OFF128") __attribute__((section("sfrs"), address(0xBF810740)));
#define OFF129 OFF129
extern volatile uint32_t   OFF129 __attribute__((section("sfrs"), address(0xBF810744)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF129bits_t;
extern volatile __OFF129bits_t OFF129bits __asm__ ("OFF129") __attribute__((section("sfrs"), address(0xBF810744)));
#define OFF130 OFF130
extern volatile uint32_t   OFF130 __attribute__((section("sfrs"), address(0xBF810748)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF130bits_t;
extern volatile __OFF130bits_t OFF130bits __asm__ ("OFF130") __attribute__((section("sfrs"), address(0xBF810748)));
#define OFF131 OFF131
extern volatile uint32_t   OFF131 __attribute__((section("sfrs"), address(0xBF81074C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF131bits_t;
