MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFH064/mcu.h
#define _C1RXF21_EXID_POSITION                   0x00000013
#define _C1RXF21_EXID_MASK                       0x00080000
#define _C1RXF21_EXID_LENGTH                     0x00000001

#define _C1RXF21_SID_POSITION                    0x00000015
#define _C1RXF21_SID_MASK                        0xFFE00000
#define _C1RXF21_SID_LENGTH                      0x0000000B

#define _C1RXF21_w_POSITION                      0x00000000
#define _C1RXF21_w_MASK                          0xFFFFFFFF
#define _C1RXF21_w_LENGTH                        0x00000020

#define _C1RXF22_EID_POSITION                    0x00000000
#define _C1RXF22_EID_MASK                        0x0003FFFF
#define _C1RXF22_EID_LENGTH                      0x00000012

#define _C1RXF22_EXID_POSITION                   0x00000013
#define _C1RXF22_EXID_MASK                       0x00080000
#define _C1RXF22_EXID_LENGTH                     0x00000001

#define _C1RXF22_SID_POSITION                    0x00000015
#define _C1RXF22_SID_MASK                        0xFFE00000
#define _C1RXF22_SID_LENGTH                      0x0000000B

#define _C1RXF22_w_POSITION                      0x00000000
#define _C1RXF22_w_MASK                          0xFFFFFFFF
#define _C1RXF22_w_LENGTH                        0x00000020

#define _C1RXF23_EID_POSITION                    0x00000000
#define _C1RXF23_EID_MASK                        0x0003FFFF
#define _C1RXF23_EID_LENGTH                      0x00000012

#define _C1RXF23_EXID_POSITION                   0x00000013
#define _C1RXF23_EXID_MASK                       0x00080000
#define _C1RXF23_EXID_LENGTH                     0x00000001

#define _C1RXF23_SID_POSITION                    0x00000015
#define _C1RXF23_SID_MASK                        0xFFE00000
#define _C1RXF23_SID_LENGTH                      0x0000000B

#define _C1RXF23_w_POSITION                      0x00000000
#define _C1RXF23_w_MASK                          0xFFFFFFFF
#define _C1RXF23_w_LENGTH                        0x00000020

#define _C1RXF24_EID_POSITION                    0x00000000
#define _C1RXF24_EID_MASK                        0x0003FFFF
#define _C1RXF24_EID_LENGTH                      0x00000012

#define _C1RXF24_EXID_POSITION                   0x00000013
#define _C1RXF24_EXID_MASK                       0x00080000
#define _C1RXF24_EXID_LENGTH                     0x00000001

#define _C1RXF24_SID_POSITION                    0x00000015
#define _C1RXF24_SID_MASK                        0xFFE00000
#define _C1RXF24_SID_LENGTH                      0x0000000B

#define _C1RXF24_w_POSITION                      0x00000000
#define _C1RXF24_w_MASK                          0xFFFFFFFF
#define _C1RXF24_w_LENGTH                        0x00000020

#define _C1RXF25_EID_POSITION                    0x00000000
#define _C1RXF25_EID_MASK                        0x0003FFFF
#define _C1RXF25_EID_LENGTH                      0x00000012

#define _C1RXF25_EXID_POSITION                   0x00000013
#define _C1RXF25_EXID_MASK                       0x00080000
#define _C1RXF25_EXID_LENGTH                     0x00000001

#define _C1RXF25_SID_POSITION                    0x00000015
#define _C1RXF25_SID_MASK                        0xFFE00000
#define _C1RXF25_SID_LENGTH                      0x0000000B

#define _C1RXF25_w_POSITION                      0x00000000
#define _C1RXF25_w_MASK                          0xFFFFFFFF
#define _C1RXF25_w_LENGTH                        0x00000020

#define _C1RXF26_EID_POSITION                    0x00000000
#define _C1RXF26_EID_MASK                        0x0003FFFF
#define _C1RXF26_EID_LENGTH                      0x00000012

#define _C1RXF26_EXID_POSITION                   0x00000013
#define _C1RXF26_EXID_MASK                       0x00080000
#define _C1RXF26_EXID_LENGTH                     0x00000001

#define _C1RXF26_SID_POSITION                    0x00000015
#define _C1RXF26_SID_MASK                        0xFFE00000
#define _C1RXF26_SID_LENGTH                      0x0000000B

#define _C1RXF26_w_POSITION                      0x00000000
#define _C1RXF26_w_MASK                          0xFFFFFFFF
#define _C1RXF26_w_LENGTH                        0x00000020

#define _C1RXF27_EID_POSITION                    0x00000000
#define _C1RXF27_EID_MASK                        0x0003FFFF
#define _C1RXF27_EID_LENGTH                      0x00000012

#define _C1RXF27_EXID_POSITION                   0x00000013
#define _C1RXF27_EXID_MASK                       0x00080000
#define _C1RXF27_EXID_LENGTH                     0x00000001

#define _C1RXF27_SID_POSITION                    0x00000015
#define _C1RXF27_SID_MASK                        0xFFE00000
#define _C1RXF27_SID_LENGTH                      0x0000000B

#define _C1RXF27_w_POSITION                      0x00000000
#define _C1RXF27_w_MASK                          0xFFFFFFFF
#define _C1RXF27_w_LENGTH                        0x00000020

#define _C1RXF28_EID_POSITION                    0x00000000
#define _C1RXF28_EID_MASK                        0x0003FFFF
#define _C1RXF28_EID_LENGTH                      0x00000012

#define _C1RXF28_EXID_POSITION                   0x00000013
#define _C1RXF28_EXID_MASK                       0x00080000
#define _C1RXF28_EXID_LENGTH                     0x00000001

#define _C1RXF28_SID_POSITION                    0x00000015
#define _C1RXF28_SID_MASK                        0xFFE00000
#define _C1RXF28_SID_LENGTH                      0x0000000B

#define _C1RXF28_w_POSITION                      0x00000000
#define _C1RXF28_w_MASK                          0xFFFFFFFF
#define _C1RXF28_w_LENGTH                        0x00000020

#define _C1RXF29_EID_POSITION                    0x00000000
#define _C1RXF29_EID_MASK                        0x0003FFFF
#define _C1RXF29_EID_LENGTH                      0x00000012

#define _C1RXF29_EXID_POSITION                   0x00000013
#define _C1RXF29_EXID_MASK                       0x00080000
#define _C1RXF29_EXID_LENGTH                     0x00000001

#define _C1RXF29_SID_POSITION                    0x00000015
#define _C1RXF29_SID_MASK                        0xFFE00000
#define _C1RXF29_SID_LENGTH                      0x0000000B

